{
  "id": "minecraft:kinetic_weapon",
  "fields": [],
  "generatedFromSchema_doNotEdit": {
    "id": "minecraft:kinetic_weapon",
    "title": "Item Components Kinetic Weapon",
    "description": "Allows an item to deal kinetic damage and its effects. This happens every tick while in use, in a straight line along the user's view vector, with damage computed based on both the user's and the target's velocity projected onto the view vector (via a dot product). The more the user and target move toward each other, and the more this movement is aligned with the user's view vector, the higher the damage. After \"damage_multiplier\" and \"damage_modifier\" are applied, the resulting damage is floored to the nearest lower integer.",
    "fields": [
      {
        "id": "damage_conditions",
        "title": "Damage Conditions",
        "description": "Conditions that need to be satisfied for damage to be applied. If not specified, damage is not applied.",
        "dataType": 16,
        "subFormId": "item_components/minecraft_kinetic_weapon_kinetic_effect_conditions"
      },
      {
        "id": "damage_modifier",
        "title": "Damage Modifier",
        "description": "Value added to the the scaled dot product (after applying \"damage_multiplier\"). Default value: 0.",
        "dataType": 3
      },
      {
        "id": "damage_multiplier",
        "title": "Damage Multiplier",
        "description": "Value multiplied to sum of the dot products of the user and target's velocity vectors projected onto the view vector. Default value: 1.",
        "dataType": 3
      },
      {
        "id": "delay",
        "title": "Delay",
        "description": "Time, in ticks, after which kinetic damage and its effects start being applied. Default value: 0.",
        "dataType": 0
      },
      {
        "id": "dismount_conditions",
        "title": "Dismount Conditions",
        "description": "Conditions that need to be satisfied for riders to be dismounted. If not specified, riders cannot be dismounted.",
        "dataType": 16,
        "subFormId": "item_components/minecraft_kinetic_weapon_kinetic_effect_conditions"
      },
      {
        "id": "hitbox_margin",
        "title": "Hitbox Margin",
        "description": "Added tolerance to the view vector raycast for detecting entity collisions. Default value: 0.",
        "dataType": 3
      },
      {
        "id": "knockback_conditions",
        "title": "Knockback Conditions",
        "description": "Conditions that need to be satisfied for knockback to be applied. If not specified, knockback is not applied.",
        "dataType": 16,
        "subFormId": "item_components/minecraft_kinetic_weapon_kinetic_effect_conditions"
      },
      {
        "id": "reach",
        "title": "Reach",
        "description": "Defines the range (in blocks) along the user's view vector where entities can be hit. Only targets within this distance are considered. Block collisions between the user and target block damage and its effects. Default value: [0, 3].",
        "dataType": 16,
        "subFormId": "item_components/floatrange"
      }
    ]
  }
}