{
  "id": "Components",
  "fields": [],
  "generatedFromSchema_doNotEdit": {
    "id": "Components",
    "title": "Block Components Components",
    "fields": [
      {
        "id": "minecraft:destructible_by_explosion",
        "title": "Minecraft Destructible By Explosion",
        "description": "Describes the destructible by explosion properties for this block. If set to true, the block will have the default explosion resistance. If set to false, this block is indestructible by explosion. If the component is omitted, the block will have the default explosion resistance.",
        "dataType": 1,
        "alternates": [
          {
            "id": "minecraft:destructible_by_explosion",
            "dataType": 16,
            "subForm": {
              "id": "minecraft:destructible_by_explosion",
              "title": "Destructible By Explosion",
              "fields": [
                {
                  "id": "explosion_resistance",
                  "title": "Explosion Resistance",
                  "description": "Sets the explosion resistance for the block. Greater values result in greater resistance to explosions. The scale will be different for different explosion power levels. A negative value or 0 means it will easily explode; larger numbers increase level of resistance.",
                  "dataType": 3,
                  "isRequired": true
                }
              ]
            }
          }
        ]
      },
      {
        "id": "minecraft:destructible_by_mining",
        "title": "Minecraft Destructible By Mining",
        "description": "Describes the destructible by mining properties for this block. If set to true, the block will take the default number of seconds to destroy. If set to false, this block is indestructible by mining. If the component is omitted, the block will take the default number of seconds to mine.",
        "dataType": 1,
        "alternates": [
          {
            "id": "minecraft:destructible_by_mining",
            "dataType": 16,
            "subForm": {
              "id": "minecraft:destructible_by_mining",
              "title": "Destructible By Mining",
              "fields": [
                {
                  "id": "item_specific_speeds",
                  "title": "Item Specific Speeds",
                  "description": "Optional array with item specific mining speeds.",
                  "dataType": 16,
                  "defaultValue": [],
                  "subFormId": "block_components/item_specific_speed"
                },
                {
                  "id": "seconds_to_destroy",
                  "title": "Seconds To Destroy",
                  "description": "Sets the number of seconds it takes to mine the block with base equipment. Greater numbers result in greater mining times. A negative number means the block can't be mined",
                  "dataType": 3,
                  "isRequired": true
                }
              ]
            }
          }
        ]
      },
      {
        "id": "minecraft:destruction_particles",
        "title": "Minecraft Destruction Particles",
        "description": "Sets the particles that will be used when block is destroyed. This component can be omitted.",
        "dataType": 16,
        "subFormId": "block_components/destruction_particles"
      },
      {
        "id": "minecraft:display_name",
        "title": "Minecraft Display Name",
        "description": "Specifies the language file key that maps to what text will be displayed when you hover over the block in your inventory and hotbar. If the string given can not be resolved as a loc string, the raw string given will be displayed. If this component is omitted, the name of the block will be used as the display name.",
        "dataType": 16
      },
      {
        "id": "minecraft:flammable",
        "title": "Minecraft Flammable",
        "description": "Describes the flammable properties for this block. If set to true, default values are used. If set to false, or if this component is omitted, the block will not be able to catch on fire naturally from neighbors, but it can still be directly ignited.",
        "dataType": 1,
        "alternates": [
          {
            "id": "minecraft:flammable",
            "dataType": 16,
            "subForm": {
              "id": "minecraft:flammable",
              "title": "Flammable",
              "description": "Describes the flammable properties for this block. If this component is omitted, the block will not be able to catch on fire naturally from neighbors, but it can still be directly ignited.",
              "fields": [
                {
                  "id": "catch_chance_modifier",
                  "title": "Catch Chance Modifier",
                  "description": "A modifier affecting the chance that this block will catch flame when next to a fire. Values are greater than or equal to 0, with a higher number meaning more likely to catch on fire. For a catch_chance_modifier greater than 0, the fire will continue to burn until the block is destroyed (or it will burn forever if the destroy_chance_modifier is 0). If the catch_chance_modifier is 0, and the block is directly ignited, the fire will eventually burn out without destroying the block (or it will have a chance to be destroyed if destroy_chance_modifier is greater than 0). The default value of 5 is the same as that of Planks.",
                  "dataType": 0,
                  "defaultValue": 5
                },
                {
                  "id": "destroy_chance_modifier",
                  "title": "Destroy Chance Modifier",
                  "description": "A modifier affecting the chance that this block will be destroyed by flames when on fire. Values are greater than or equal to 0, with a higher number meaning more likely to be destroyed by fire. For a destroy_chance_modifier of 0, the block will never be destroyed by fire, and the fire will burn forever if the catch_chance_modifier is greater than 0. The default value of 20 is the same as that of Planks.",
                  "dataType": 0,
                  "defaultValue": 20
                }
              ]
            }
          }
        ]
      },
      {
        "id": "minecraft:geometry",
        "title": "Minecraft Geometry",
        "description": "The component that describes the geometry to use to render this block. It can be specified as a JSON object with the following fields, or simply as a string containing the description identifier of the geometry to use to render this block. This identifier must either match an existing geometry identifier in any of the loaded resource packs or be one of the currently supported Vanilla identifiers: \"minecraft:geometry.full_block\" or \"minecraft:geometry.cross\".",
        "dataType": 2,
        "alternates": [
          {
            "id": "minecraft:geometry",
            "dataType": 16,
            "subForm": {
              "id": "minecraft:geometry",
              "title": "Geometry",
              "fields": [
                {
                  "id": "bone_visibility",
                  "title": "Bone Visibility",
                  "description": "A JSON object that contains a list of key/value pairs that map from bone name in the specified geometry file (key) to a Molang expression that tells whether the bone should be visible or not (value). The expression is limited to using the \"query.block_state()\" query. When using \"bone_visibility\" in geometry components in the \"permutations\" section, you must also have a default version of the geometry component with \"bone_visibility\" in the \"components\" section.",
                  "dataType": 24,
                  "defaultValue": {},
                  "alternates": [
                    {
                      "id": "bone_visibility",
                      "dataType": 14,
                      "readOnly": true,
                      "subForm": {
                        "id": "bone_visibility",
                        "title": "Bone Visibility",
                        "fields": [
                          {
                            "id": "expression",
                            "title": "Expression",
                            "dataType": 2,
                            "isRequired": true
                          },
                          {
                            "id": "version",
                            "title": "Version",
                            "dataType": 0,
                            "isRequired": true
                          }
                        ]
                      }
                    },
                    {
                      "id": "bone_visibility",
                      "dataType": 3
                    }
                  ]
                },
                {
                  "id": "culling",
                  "title": "Culling",
                  "description": "Which block_culling .json file to use when rendering this block.",
                  "dataType": 2,
                  "defaultValue": ""
                },
                {
                  "id": "culling_layer",
                  "title": "Culling Layer",
                  "description": "A string that allows culling rule to group multiple blocks together when comparing them. When using the minecraft namespace, the only allowed culling layer identifiers are : \"minecraft:culling_layer.undefined\" or \"minecraft:culling_layer.leaves\". When using no namespaces or a custom one, the names must start and end with an alpha-numeric character.",
                  "dataType": 2,
                  "validity": [
                    {
                      "comparison": "pattern",
                      "value": "^(?:minecraft:culling_layer.undefined|minecraft:culling_layer.leaves|(?!minecraft:)[a-z0-9].*[a-z0-9])$"
                    }
                  ]
                },
                {
                  "id": "identifier",
                  "title": "Identifier",
                  "description": "The description identifier of the geometry to use to render this block. This identifier must either match an existing geometry identifier in any of the loaded resource packs or be one of the currently supported Vanilla identifiers: \"minecraft:geometry.full_block\" or \"minecraft:geometry.cross\".",
                  "dataType": 2,
                  "isRequired": true
                },
                {
                  "id": "uv_lock",
                  "title": "Uv Lock",
                  "description": "A field that is either a Boolean or an array of strings, max size 64 strings. This field locks UV orientation for all/some bones in the geometry, regardless of how the block is rotated using \"minecraft:transformation\" component. For performance reasons it's recommended to use the Boolean.",
                  "dataType": 16,
                  "defaultValue": false
                }
              ]
            }
          }
        ]
      },
      {
        "id": "minecraft:light_dampening",
        "title": "Minecraft Light Dampening",
        "description": "The amount that light will be dampened when it passes through the block. Higher value means the light will be dampened more.",
        "dataType": 16
      },
      {
        "id": "minecraft:light_emission",
        "title": "Minecraft Light Emission",
        "description": "The amount of light this block will emit. Higher value means more light will be emitted.",
        "dataType": 16
      },
      {
        "id": "minecraft:map_color",
        "title": "Minecraft Map Color",
        "description": "Sets the color and optional tint of the block when rendered to a map.",
        "dataType": 16,
        "subFormId": "block_components/map_color"
      },
      {
        "id": "minecraft:material_instances",
        "title": "Minecraft Material Instances",
        "description": "The material instances for a block.\nMaps face or material_instance names in a geometry file to an actual material instance. Material instance can either be a full material instance or a name to another already defined instance.\nLimited to 64 instances.",
        "dataType": 16
      },
      {
        "id": "minecraft:redstone_conductivity",
        "title": "Minecraft Redstone Conductivity",
        "description": "The basic redstone properties of a block. If the component is not provided the default values are used.",
        "dataType": 16,
        "subFormId": "block_components/redstone_conductivity"
      },
      {
        "id": "minecraft:redstone_producer",
        "title": "Minecraft Redstone Producer",
        "description": "The definitions for how a block can produce a redstone signal.",
        "dataType": 16,
        "subFormId": "block_components/redstone_producer"
      },
      {
        "id": "minecraft:support",
        "title": "Minecraft Support",
        "description": "Defines the support shape of the block. Currently only allows for blocks to have the same shape as a Vanilla fence and Vanilla stair. To work with custom stairs, requires the use of \"minecraft:vertical_half\" and \"minecraft:cardinal_direction\" or \"minecraft:facing_direction\" which can be set through the \"minecraft:placement_direction\" block trait. Custom blocks without this component will default to unit cube support. The type of support shape for this block. Currently, the options are: \"fence\" and \"stair\".",
        "dataType": 16,
        "subFormId": "block_components/support"
      },
      {
        "id": "minecraft:tags",
        "title": "Minecraft Tags",
        "description": "Use this component to define tags, vanilla or custom. Valid tags are of the format \"namespace:tag_name\". The array of tags must be non-empty.",
        "dataType": 16
      }
    ]
  }
}